# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Thu Oct 30 14:19:23 IST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design fft_4pt

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports data_valid_in]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_r[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x0_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_r[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x1_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_r[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x2_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_r[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {x3_i[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports data_valid_out]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_r[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X0_i[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_r[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X1_i[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_r[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X2_i[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_r[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 4.0 [get_ports {X3_i[0]}]
set_ideal_network [get_ports rst_n]
set_wire_load_mode "enclosed"
set_clock_latency -source 0.5 [get_clocks clk]
set_clock_uncertainty -setup 0.5 [get_clocks clk]
set_clock_uncertainty -hold 0.5 [get_clocks clk]
